app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "ZZZZ"], ["content", "zzzzzzz"], ["post_id", 9], ["created_at", "2021-07-31 14:41:57.339681"], ["updated_at", "2021-07-31 14:41:57.339681"]]
---
    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(comment_params)