app/controllers/posts_controller.rb

    def index()
        puts ">>>>>> Posts Controller index!"
        # TODO: Only for angular project currently not connecting to a sign_out api
        sign_out current_author

        puts ">>>>>>>>>> params[:blogger_id]", params[:blogger_id]
        if params[:blogger_id]
            puts ">>>>>>>>>> params[:blogger_id]", params[:blogger_id]
            @blogger = Author.find(params[:blogger_id])
        elsif params[:blogger]
            puts ">>>>>>>>>> params[:blogger]", params[:blogger]
            @blogger = Author.where('email = ?', params[:blogger]).first
---
SELECT "authors".* FROM "authors" WHERE (email = 'pc@ibm')