app/controllers/posts_controller.rb

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? ORDER BY "authors"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 10]]
SELECT COUNT(*) FROM "posts" WHERE (author_id = 2)
---
    def index()
        puts ">>>>>> Posts Controller index!"

        if params[:blogger_id]
            @blogger = Author.find(params[:blogger_id])
        elsif params[:blogger]
            @blogger = Author.where('email = ?', params[:blogger]).first
        end
        if !@blogger
            # Get all posts result
            post_relation = Post.order('created_at DESC')
        else
            # Get posts result by blogger
            post_relation = Post.where('author_id = ?', @blogger.id).order('created_at DESC')
        end

        # Total posts of current relation
        @total_posts = post_relation.count

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
    def show
        puts ">>>>>> Posts Controller show!"
        @post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def edit
        puts ">>>>>> Posts Controller edit!"
        @post = Post.find(params[:id])

INSERT INTO "posts" ("title", "text", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "pcpc_0801"], ["text", "010101010"], ["created_at", "2021-08-01 14:18:49.416587"], ["updated_at", "2021-08-01 14:18:49.416587"], ["author_id", 1]]
---
    def create
        puts ">>>>>> Posts Controller create!"
        # render json: params[:post]
        @post = Post.new(post_params)
        @post.author_id = current_author.id
        if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["text", "4e content"], ["updated_at", "2021-08-01 14:12:00.729165"], ["id", 8]]
---
    def update
        puts ">>>>>> Posts Controller update!"
        @post = Post.find(params[:id])
        validate_the_author_of_the_post(@post)
        @author = current_author
        if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 5]]
---
    def destroy
        @post = Post.find(params[:id])
        validate_the_author_of_the_post(@post)
        @post.destroy